<details ><summary>apply for fundaztic 2025-08-11 15:04:49 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#fundaztic has been locked by PR #6
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic must be replaced
-/+ resource "oci_artifacts_container_repository" "fundaztic" {
      ~ billable_size_in_gbs = "0" -> (known after apply)
      ~ created_by           = "ocid1.user.oc1..aaaaaaaatqz6hzvcyjgkiztbzxrym7hfjvofokd4ftux3dlmyay2bqaaaxsa" -> (known after apply)
      ~ defined_tags         = {} -> (known after apply)
      ~ display_name         = "fundaztic" -> "fundaztic/" # forces replacement
      ~ freeform_tags        = {} -> (known after apply)
      ~ id                   = "ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaazsq3pd5wmrknqaqhapurv2jqglpjglkiko6w5fe7alsjivf7r2ra" -> (known after apply)
      ~ image_count          = 0 -> (known after apply)
      ~ layer_count          = 0 -> (known after apply)
      ~ layers_size_in_bytes = "0" -> (known after apply)
      ~ namespace            = "ax1h9bph8nyo" -> (known after apply)
      ~ state                = "AVAILABLE" -> (known after apply)
      ~ system_tags          = {} -> (known after apply)
      ~ time_created         = "2025-08-11 10:01:49.8 +0000 UTC" -> (known after apply)
      + time_last_pushed     = (known after apply)
        # (3 unchanged attributes hidden)

      ~ readme (known after apply)
    }

  # oci_objectstorage_bucket.test_bucket will be created
  + resource "oci_objectstorage_bucket" "test_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "my-test-bucket"
      + namespace                    = "ax1h9bph8nyo"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
oci_artifacts_container_repository.fundaztic: Destroying... [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaazsq3pd5wmrknqaqhapurv2jqglpjglkiko6w5fe7alsjivf7r2ra]
oci_objectstorage_bucket.test_bucket: Creating...
oci_artifacts_container_repository.fundaztic: Destruction complete after 2s
oci_artifacts_container_repository.fundaztic: Creating...
oci_objectstorage_bucket.test_bucket: Creation complete after 2s [id=n/ax1h9bph8nyo/b/my-test-bucket]
oci_artifacts_container_repository.fundaztic: Creation complete after 0s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaaslfuaodjlymz6qnekvrypkykuiefk7cuizqrofdeiaijxwb35nga]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```
</details>

</details>